%fs采样频率，L信号长度
function output = generate_signal(fs,L);
%采样周期
T=1/fs;
%在时间轴上的表示
t=(0:L-1)*T;
%信号表示,0.7幅值，800Hz正弦信号，0.4幅值，1200Hz正弦信号
s = 0.7*sin(2*pi*800*t)+0.4*sin(2*pi*1200*t);


y=fft(s);

%双侧频谱
P2 = abs(y/L);

%取单侧频谱
P1 = P2(1:L/2+1);

%除零频之外的点取2倍
P1(2:end-1) = 2*P1(2:end-1);

%转换为频率表达，其实也就是采样所采到的频率.可以看到*后面的表达式为（0：1/2）；也就是满足抽样定理
f=fs*(0:(L/2))/L;


 subplot(2,1,1);%在第1行绘制原始信号
 plot(t,s);
 title('原始信号图');
 
subplot(2,1,2);%在第1行绘制原始信号
 plot(f,P1);
 title('频谱图');

output = s;
